In [1]:
import pandas as pd

In [47]:
import numpy as np

In [28]:
df=pd.read_csv('/home/barani/Downloads/cars.csv',header=None)

In [13]:
df

       0    1              2      3      4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

In [29]:
df.columns=['country code','region','country','cars_per_cap', 'drive_right']

In [15]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [30]:
df

  country code region        country  cars_per_cap  drive_right
0         USCA     US  United States         809.0        False
1        ASPAC    AUS      Australia         731.0         True
2        ASPAC    JAP          Japan         588.0         True
3        ASPAC     IN          India          18.0         True
4        ASPAC     RU         Russia         200.0        False
5        LATAM    MOR        Morocco          70.0        False
6          AFR     EG          Egypt          45.0        False
7          EUR    ENG        England           NaN         True

In [35]:
df=pd.read_csv('/home/barani/Downloads/cars.csv',header=None,index_col=0)

### Removing the index column

In [18]:
df

         1              2      3      4
0
USCA    US  United States  809.0  False
ASPAC  AUS      Australia  731.0   True
ASPAC  JAP          Japan  588.0   True
ASPAC   IN          India   18.0   True
ASPAC   RU         Russia  200.0  False
LATAM  MOR        Morocco   70.0  False
AFR     EG          Egypt   45.0  False
EUR    ENG        England    NaN   True

In [19]:
df.index

Index(['USCA', 'ASPAC', 'ASPAC', 'ASPAC', 'ASPAC', 'LATAM', 'AFR', 'EUR'], dtype='object', name=0)

In [20]:
df.index.name='test'

In [21]:
df

         1              2      3      4
test
USCA    US  United States  809.0  False
ASPAC  AUS      Australia  731.0   True
ASPAC  JAP          Japan  588.0   True
ASPAC   IN          India   18.0   True
ASPAC   RU         Russia  200.0  False
LATAM  MOR        Morocco   70.0  False
AFR     EG          Egypt   45.0  False
EUR    ENG        England    NaN   True

In [32]:
df.index.name=None

In [37]:
df

         1              2      3      4
0
USCA    US  United States  809.0  False
ASPAC  AUS      Australia  731.0   True
ASPAC  JAP          Japan  588.0   True
ASPAC   IN          India   18.0   True
ASPAC   RU         Russia  200.0  False
LATAM  MOR        Morocco   70.0  False
AFR     EG          Egypt   45.0  False
EUR    ENG        England    NaN   True

In [39]:
df=pd.read_csv('/home/barani/Downloads/cars.csv',header=None)

In [40]:
df.columns=['country code','region','country','cars_per_cap', 'drive_right']

In [42]:
df

  country code region        country  cars_per_cap  drive_right
0         USCA     US  United States         809.0        False
1        ASPAC    AUS      Australia         731.0         True
2        ASPAC    JAP          Japan         588.0         True
3        ASPAC     IN          India          18.0         True
4        ASPAC     RU         Russia         200.0        False
5        LATAM    MOR        Morocco          70.0        False
6          AFR     EG          Egypt          45.0        False
7          EUR    ENG        England           NaN         True

In [43]:
df.set_index(['country'],inplace=True)

In [44]:
df

              country code region  cars_per_cap  drive_right
country
United States         USCA     US         809.0        False
Australia            ASPAC    AUS         731.0         True
Japan                ASPAC    JAP         588.0         True
India                ASPAC     IN          18.0         True
Russia               ASPAC     RU         200.0        False
Morocco              LATAM    MOR          70.0        False
Egypt                  AFR     EG          45.0        False
England                EUR    ENG           NaN         True

In [45]:
df.info

<bound method DataFrame.info of               country code region  cars_per_cap  drive_right
country
United States         USCA     US         809.0        False
Australia            ASPAC    AUS         731.0         True
Japan                ASPAC    JAP         588.0         True
India                ASPAC     IN          18.0         True
Russia               ASPAC     RU         200.0        False
Morocco              LATAM    MOR          70.0        False
Egypt                  AFR     EG          45.0        False
England                EUR    ENG           NaN         True>

In [48]:
np.arange(1,16,2).reshape(4, 2)

array([[ 1,  3],
       [ 5,  7],
       [ 9, 11],
       [13, 15]])